// import { useEffect, useState } from "react";
// import styles from "./Hero.module.css";
// import "../../styles/global.css";
//
//
// const quotes = [
//     "Земля сміється квітами.",
//     "У швидко в’яне пелюстках квітки більше життя, ніж в огрядних тисячолітніх брилах граніту. Людвіг Андреас фон Файербах",
//     "Любов як квітка – їй потрібен час, щоб розквітнути.",
//     "Квіти – залишки раю на Землі.",
//     "Квіти, як люди, на добро щедрі і, людям ніжність віддаючи, вони цвітуть, серця обігріваючи, як маленькі, теплі багаття. Жане Кірімізе",
//     "Квіти – вірші природи.",
//     "Іноді квіти – це просто квіти.",
//     "Квіти – найкраще з усього, що Господь створив, але забув наділити душею. Генрі Уорд Бічер",
//     "Квіти – це вільна краса в природі.",
//     "Квіти цвітуть всюди для всіх, хто тільки хоче їх бачити.",
//     "Лише квіти живуть по-справжньому. Живуть відраховані ним дні так відчайдушно кольору, ніби розуміють краще людей швидкоплинність життя.",
//     "Є квіти, які цвітуть рано, і є квіти, які цвітуть пізно. Люди розквітають так само.",
//     "Квіти співають. Вони завжди співають. Навіть якщо люди не чують …",
//     "Там, де вироджуються квіти, не може жити людина. Георг Вільгельм Фрідріх Гегель",
//     "Квіти не вирішують усіх проблем. Але вони – гарний початок.",
//     "Запах – душа квітки. Жюль Верн",
//     "У квітів не буває буднів, вони завжди одягнені святково. Малкольм де Шазаль",
//     "Хіба можна сказати квітці що вона негарна? Володимир Бурич",
//     "Там, де вироджуються квіти, не може жити людина. Георг Гегель",
//     "Квітка в теплі і взимку цвіте. Сілован Рамішвілі",
//     "Скільки б ми не говорили про порожнечу життя, іноді достатньо лише однієї квітки, щоб нас переконати. Анатоль Франс",
//     "Кажуть, недовговічні квіти кружляють у танці, коли їх відносить вітром. Код Гіасс",
//     "Зрізані для букета квіти – варварство в ім’я краси … Ігор Красновський",
//     "Жителі планети, де немає квітів, вирішили б, що на Землі, де квіти на кожному кроці, ми, напевно, з розуму сходимо від радості. Айріс Мердок",
//     "Де багато любові, квітів – завжди мало. Леонід Сухоруков",
//     "Троянди прищеплюють любов до природи, а шипи – повага. Антон Лігова",
//     "Улюблений квітка – це, перш за все, відмова від всіх інших кольорів. Інакше він не здасться найпрекраснішим.",
//     "У швидко в’яне пелюстках квітки більше життя, ніж в огрядних тисячолітніх брилах граніту. Людвіг Фейєрбах",
//     "У житті як у театрі: квіти дістаються тільки після відходу зі сцени. Яна Джангірова",
//     "Квіти – якісь матеріальні флюїди, якими люди можуть обмінюватися між собою. Ольга Шелест",
//     "У квітів своя мова. Вони мовчать, але говорять багато про що!",
//     "Щоб жити, потрібне сонце, свобода і маленька квітка. Ганс Християн Андерсен",
//     "Скільки б ми не говорили про порожнечу життя, іноді достатньо лише однієї квітки, щоб нас переконати.",
//     "Мистецтво є безперервна спроба змагатися з красою квітів – і завжди безуспішно. Марк Шагал",
//     "Простягаючи руки до зірок, люди часто забувають про квіти під ногами.",
//     "Тріумф квітки настає, коли її вже зрізано, справжнє її життя невідривно від смерті.",
//     "Аромати – це почуття квітів. Генріх Гейне",
//     "Квітку можна порівняти із задоволенням, яке незабаром зів’яне, а запах цієї квітки – це подібно до спогадів, які пам’ятаються вічно!",
//     "Якщо у Вашому житті пішов дощ, зосередьтеся на квітах, які зацвітуть завдяки цьому дощу.",
//     "Без любові люди в’януть, немов зрізані квіти, в якій би кришталевій вазі вони не стояли.",
//     "Навіть у війні розпускаються квіти.",
//     "Серця – як квіти, – їх не можна відкрити силою, вони повинні розкритися самі. Луїза Мей Олкотт",
//     "Нємає жінок, які не люблять квіти, є чоловіки, які так вважають.",
//     "Щоб квіти в твоїх очах завжди залишалися живими.",
//     "Звичайно, я міг би обійтися і без квітів, але вони допомагають мені зберегти повагу до самого себе, бо доводять, що я не скутий по руках і ногах буденними турботами. Вони свідчення моєї волі. Рабіндранат Тагор",
//     "Обриваючи пелюстки квітки, ти не отримуєш її краси.",
//     "Ідеальна жінка нагадує загадкову квітку.",
//     "Квіти — це усмішка природи.",
//     "Квіти — це поезія землі.",
//     "Де квіти — там надія.",
//     "Дівчина прекрасна, як квітка. А кожна квітка повинна бути трохи розпущеною. Єва Лонгорія",
//     "Я сподіваюся, що, поки стільки людей насолоджуються ароматом квітів, хтось знаходить час, щоб посадити їх. Герберт Раппопорт",
//     "Той, хто любить квіти, не може бути злим.",
//     "Після жінок, квіти – самі чудові створіння на землі. Крістіан Діор.",
//     "Жінка без кохання чахне, як квітка без сонця. – Мирзакарім Норбеков",
//     "Щастя не в кількості подарованих троянд, щастя у людині, яка їх дарує.",
//     "Кожна квітка, що розкривається, нагадує нам про те, що світ ще не втомився від фарб. Фабриціо Караманья",
//     "Якщо хочеш користуватися плодами, не рви квітів. Г. Бон",
//     "У радості чи смутку квіти – наші постійні друзі. Окакура Какудзо",
//     "Ви можете зрізати всі квіти, але ви не можете запобігти приходу весни. – Пабло Неруда"
// ];
//
// export default function Hero() {
//     const [offsetY, setOffsetY] = useState(0);
//     const [quote, setQuote] = useState("");
//
//     const getRandomQuote = () => {
//         const randomIndex = Math.floor(Math.random() * quotes.length);
//         return quotes[randomIndex];
//     };
//
//     useEffect(() => {
//         setQuote(getRandomQuote());
//
//         const handleScroll = () => setOffsetY(window.scrollY);
//         window.addEventListener("scroll", handleScroll);
//         return () => window.removeEventListener("scroll", handleScroll);
//     }, []);
//
//     useEffect(() => {
//         const interval = setInterval(() => {
//             setQuote(getRandomQuote());
//         }, 18000);
//         return () => clearInterval(interval);
//     }, []);
//
//     return (
//         <section
//             className={styles.hero}
//             style={{ backgroundPositionY: `${offsetY * 0.5}px` }}
//         >
//             {/*<div className="container">*/}
//                 <div className={styles.quoteBox}>
//           <span
//               className={styles.clickArea}
//               onClick={() => setQuote(getRandomQuote())}
//           ></span>
//                     <p className={styles.quote}>{quote}</p>
//                 </div>
//             {/*</div>*/}
//         </section>
//     );
// }


import { useEffect, useState } from "react";
import styles from "./Hero.module.css";
import "../../styles/global.css";

const quotes = [
    "Земля сміється квітами.",
    "У швидко в’яне пелюстках квітки більше життя, ніж в огрядних тисячолітніх брилах граніту. Людвіг Андреас фон Файербах",
    "Любов як квітка – їй потрібен час, щоб розквітнути.",
    "Квіти – залишки раю на Землі.",
    "Квіти, як люди, на добро щедрі і, людям ніжність віддаючи, вони цвітуть, серця обігріваючи, як маленькі, теплі багаття. Жане Кірімізе",
    "Квіти – вірші природи.",
    "Іноді квіти – це просто квіти.",
    "Квіти – найкраще з усього, що Господь створив, але забув наділити душею. Генрі Уорд Бічер",
    "Квіти – це вільна краса в природі.",
    "Квіти цвітуть всюди для всіх, хто тільки хоче їх бачити.",
    "Лише квіти живуть по-справжньому. Живуть відраховані ним дні так відчайдушно кольору, ніби розуміють краще людей швидкоплинність життя.",
    "Є квіти, які цвітуть рано, і є квіти, які цвітуть пізно. Люди розквітають так само.",
    "Квіти співають. Вони завжди співають. Навіть якщо люди не чують …",
    "Там, де вироджуються квіти, не може жити людина. Георг Вільгельм Фрідріх Гегель",
    "Квіти не вирішують усіх проблем. Але вони – гарний початок.",
    "Запах – душа квітки. Жюль Верн",
    "У квітів не буває буднів, вони завжди одягнені святково. Малкольм де Шазаль",
    "Хіба можна сказати квітці що вона негарна? Володимир Бурич",
    "Там, де вироджуються квіти, не може жити людина. Георг Гегель",
    "Квітка в теплі і взимку цвіте. Сілован Рамішвілі",
    "Скільки б ми не говорили про порожнечу життя, іноді достатньо лише однієї квітки, щоб нас переконати. Анатоль Франс",
    "Кажуть, недовговічні квіти кружляють у танці, коли їх відносить вітром. Код Гіасс",
    "Зрізані для букета квіти – варварство в ім’я краси … Ігор Красновський",
    "Жителі планети, де немає квітів, вирішили б, що на Землі, де квіти на кожному кроці, ми, напевно, з розуму сходимо від радості. Айріс Мердок",
    "Де багато любові, квітів – завжди мало. Леонід Сухоруков",
    "Троянди прищеплюють любов до природи, а шипи – повага. Антон Лігова",
    "Улюблений квітка – це, перш за все, відмова від всіх інших кольорів. Інакше він не здасться найпрекраснішим.",
    "У швидко в’яне пелюстках квітки більше життя, ніж в огрядних тисячолітніх брилах граніту. Людвіг Фейєрбах",
    "У житті як у театрі: квіти дістаються тільки після відходу зі сцени. Яна Джангірова",
    "Квіти – якісь матеріальні флюїди, якими люди можуть обмінюватися між собою. Ольга Шелест",
    "У квітів своя мова. Вони мовчать, але говорять багато про що!",
    "Щоб жити, потрібне сонце, свобода і маленька квітка. Ганс Християн Андерсен",
    "Скільки б ми не говорили про порожнечу життя, іноді достатньо лише однієї квітки, щоб нас переконати.",
    "Мистецтво є безперервна спроба змагатися з красою квітів – і завжди безуспішно. Марк Шагал",
    "Простягаючи руки до зірок, люди часто забувають про квіти під ногами.",
    "Тріумф квітки настає, коли її вже зрізано, справжнє її життя невідривно від смерті.",
    "Аромати – це почуття квітів. Генріх Гейне",
    "Квітку можна порівняти із задоволенням, яке незабаром зів’яне, а запах цієї квітки – це подібно до спогадів, які пам’ятаються вічно!",
    "Якщо у Вашому житті пішов дощ, зосередьтеся на квітах, які зацвітуть завдяки цьому дощу.",
    "Без любові люди в’януть, немов зрізані квіти, в якій би кришталевій вазі вони не стояли.",
    "Навіть у війні розпускаються квіти.",
    "Серця – як квіти, – їх не можна відкрити силою, вони повинні розкритися самі. Луїза Мей Олкотт",
    "Нємає жінок, які не люблять квіти, є чоловіки, які так вважають.",
    "Щоб квіти в твоїх очах завжди залишалися живими.",
    "Звичайно, я міг би обійтися і без квітів, але вони допомагають мені зберегти повагу до самого себе, бо доводять, що я не скутий по руках і ногах буденними турботами. Вони свідчення моєї волі. Рабіндранат Тагор",
    "Обриваючи пелюстки квітки, ти не отримуєш її краси.",
    "Ідеальна жінка нагадує загадкову квітку.",
    "Квіти — це усмішка природи.",
    "Квіти — це поезія землі.",
    "Де квіти — там надія.",
    "Дівчина прекрасна, як квітка. А кожна квітка повинна бути трохи розпущеною. Єва Лонгорія",
    "Я сподіваюся, що, поки стільки людей насолоджуються ароматом квітів, хтось знаходить час, щоб посадити їх. Герберт Раппопорт",
    "Той, хто любить квіти, не може бути злим.",
    "Після жінок, квіти – самі чудові створіння на землі. Крістіан Діор.",
    "Жінка без кохання чахне, як квітка без сонця. – Мирзакарім Норбеков",
    "Щастя не в кількості подарованих троянд, щастя у людині, яка їх дарує.",
    "Кожна квітка, що розкривається, нагадує нам про те, що світ ще не втомився від фарб. Фабриціо Караманья",
    "Якщо хочеш користуватися плодами, не рви квітів. Г. Бон",
    "У радості чи смутку квіти – наші постійні друзі. Окакура Какудзо",
    "Ви можете зрізати всі квіти, але ви не можете запобігти приходу весни. – Пабло Неруда"
];

export default function Hero() {
    const [offsetY, setOffsetY] = useState(0);
    const [quote, setQuote] = useState("");

    const getRandomQuote = () => quotes[Math.floor(Math.random() * quotes.length)];

    useEffect(() => {
        setQuote(getRandomQuote());

        const handleScroll = () => {
            // паралакс тільки на десктопі
            if (window.innerWidth > 1024) {
                setOffsetY(window.scrollY);
            }
        };

        window.addEventListener("scroll", handleScroll);
        return () => window.removeEventListener("scroll", handleScroll);
    }, []);

    useEffect(() => {
        const interval = setInterval(() => setQuote(getRandomQuote()), 18000);
        return () => clearInterval(interval);
    }, []);

    return (
        <section
            className={styles.hero}
            style={
                window.innerWidth > 1024
                    ? { backgroundPositionY: `${offsetY * 0.5}px` }
                    : {}
            }
        >
            <div className={styles.quoteBox}>
        <span
            className={styles.clickArea}
            onClick={() => setQuote(getRandomQuote())}
        ></span>
                <p className={styles.quote}>{quote}</p>
            </div>
        </section>
    );
}

